[Language]
; The language's name in your native language and, optionally,
; the English name of the language (e.g. in brackets)
Name=Русский (Russian)
; To translators: Add your name, nick, and/or translation date here if you want to.
; Note that this string isn't currently shown anywhere in the plugin.
Translator=Alexander Gvaramiya (Nero Wolfe)



; Strings in this section are used in several places of the plugin
[Common]
Yes=Да
No=Нет

StateRunning=Работает
StateStopped=Остановлена
StatePaused=Пауза
StatePausePending=Ожидание Паузы
StateContinuePending=Ожидание Продолжения
StateStartPending=Ожидание Старта
StateStopPending=Ожидание Остановки

StartupAutomaticDelayed=Авто (с задержкой)
StartupAutomatic=Авто
StartupManual=Вручную
StartupDisabled=Отключено

; Some Actions
ActionStarting=Запускается %s
ActionStopping=Остановка %s
ActionPausing=Приостановка %s

; Remote Computer Management
RemoteComputer=Удаленный компьютер
AddRemoteComputer=Добавить



; Strings in this section are used when
; a service "file" is viewed with F3
[GetFile]
ComputerName=Имя компьютера
ServiceName=Имя службы
DisplayName=Отображаемое имя
Description=Описание
BinaryPath=Исполняемый файл
StartupType=Тип запуска
State=Состояние
DesktopInteraction=Взаимодействие с рабочим столом
OwnProcess=Собственный процесс
LogonAs=Вход в систему
RequiredPrivileges=Необходимые привилегии



; Strings in this section are used when the service's
; properties are opened, i.e. (Alt+)Enter is pressed
[fmSvcProperties]
fmSvcProperties=Свойства %s

; Some common form components
btnOK=OK
btnCancel=Отмена
btnApply=&Применить
tsGeneral=Общие
tsAdvanced=Дополнительно
tsDependencies=Зависимости

; TabSheet General
lblServiceName=Имя службы:
lblDisplayName=Отображаемое &имя:
lblDescription=&Описание:
lblBinaryPath=&Исполняемый файл:
lblStartupType=&Тип запуска:
lblState=Состояние:
popupExecutableShowProperties=С&войства исполняемого файла
popupExecutableViewInSeparateLister=Просмотр в TC &Lister (отдельный процесс)

btnStart=&Запустить
btnPause=П&риостановить
btnStop=&Остановить
btnRestart=Пе&резапустить
; Please don't make a keyboard shortcut for the delete button!
btnDelete=Удалить
lblQueryError=Замечание: При запросе конфигурации службы произошла ошибка (Код ошибки %d). Информация о данной службе может быть не полной и/или не правильной!

; TabSheet Advanced
lblLogonAs=Вход в систему:
lblPassword=&Пароль:
lblPasswordConfirm=&Подтверждение пароля:
lblErrorControl=&Контроль ошибок:
checkInteractive=&Разрешить взаимодействие с рабочим столом
radioLocalSystem=&С системной учетной записью
radioLocalService=С системной записью службы
radioThisAccount=&С учетной записью:
radioNetworkService=&С учетной записью сетевой службы
comboErrorControl=Игнорировать\nОптимальный\nСтрогий\nКритический
btnBrowse=&Найти...
checkOwnProcess=Служба выполняется в отдельном процессе
checkWow64=Служба WOW64 (32-разр. служба на 64-разр. Windows)

; TabSheet Dependencies
lblDependent=%s необходима для:
lblDependencies=%s зависит от следующих компонентов:
TypeDriver=[Driver]
TypeGroup=[Group]

; Messages in TabSheet Dependencies
MsgNoDependencies=Нет зависимостей
MsgWarn1=Предупреждение: Не все зависимости могут быть определены!
MsgWarn2=Возможная причина: Отсутствие прав Администратора.

; Dialogs
DlgDeleteText=Вы действительно хотите удалить %s?
DlgDeleteTitle=Удалить %s?

DlgDependentsRunning1=Если служба %s будет остановлена, то так же будут остановлены данные службы:
DlgDependentsRunning2=Вы действительно хотите остановить эти службы?

DlgDependenciesStopped1=Если служба %s будет запущена, то так же будут запущены данные службы:
DlgDependenciesStopped2=Вы действительно хотите запустить эти службы?

DlgConfirmAddAccountRight=Чтобы запустить службу как "%s", учетная запись должна получить право входа в качестве службы (%s).\n\nПродолжить?
DlgAccountRightAdded=Учетной записи "%s" были предоставлены права.
DlgAccountRightNotAdded=Ошибка предоставления прав для "%s"!\nТекст ошибки: %s (%u).
DlgPasswordsDiffer=Пароли не совпадают!
DlgInvalidAccount=Указанное имя учетной записи является недопустимым!



[fmPluginSettings]
fmPluginSettings=Настройки...
lblLanguage=&Язык:
checkShowState=&Состояние службы в колонке Тип в панели TC
checkShowSvcNameAsName=Показывать Имя службы вместо Отображаемого имени в панели TC
checkClassicTreeStyle=&Классический стиль дерева зависимостей
checkAllowDeleteInPanel=&Разрешить удаление служб из панели TC
checkLoadCustomColumns=&Загружать пользовательский набор колонок в панели плагина
lblClassicTreeStyle=Значки плюс/минус вместо треугольников на ОС Vista и выше
checkEnableRemoteManagement=Разрешить управление &удаленным компьютером
checkToolsShowIcons=З&начки в списке внутренних/внешних инструментов
checkAddSvcNameToDependencyTrees=Показывать Имя службы в дереве з&ависимостей
lblIniLocation=&Файл настроек плагина:
btnOK=OK
btnCancel=Отмена
DlgReloadSettings=Завершив изменение настроек, нажмите OK для применения.



[fmAddRemoteComputer]
fmAddRemoteComputer=Добавление удаленного компьютера...
lblComputerName=&Имя удаленного компьютера:
btnBrowse=&Найти...
btnOK=&Добавить
btnCancel=Отмена
DlgSelectComputer=Выберите компьютер для добавления в список
